#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//	for ( a = 1; a <=5; a++)
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e <= 5; e++)
//					{
//						if (((b == 2) + (a == 3) == 1) &&
//							((b == 2) + (e == 4) == 1) &&
//							((c == 1) + (d == 2) == 1) &&
//							((c == 5) + (d == 3) == 1) &&
//							((e == 4) + (a == 1) == 1))
//						{
//							if(a*b*c*d*e==120)
//							printf("A=%d , B=%d , C=%d , D=%d , E=%d\n", a, b, c, d, e);
//						}
//					}
//				}
//			}
//		}
//
//	}
//	return 0;
//}

//int main()
//{
//	//4种可能;设置1为凶手
//	//A说假话时
//	//A为凶，B为凶，C为凶，D不是凶 因为只有2个凶手，所以A说的是真话
//	// a=1;b=1;c=1;d=0
//	//B说假话时
//	//A不是凶，B是凶，C是凶，D是凶，由此可得 B说真话
//	// a=0;b=1;c=1;d=1
//	//C说假话时
//	//A不是凶，B不是凶，C凶，D不是凶；C为凶
//	// a=0;b=0;c=1;d=0
//	//D说假话时
//	//A不是凶，B不是凶，C是凶，D是凶，由此可得D说的是真话
//	//a=0;b=0;c=1;d=1
//	
//	//设大家一开始说的都是真话
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	for (int i = 1; i <= 4; i++)
//	{
//		if (i == 1)
//		{
//			a = 1;
//			b = 1;
//			c = 1;
//			d = 0;
//		}
//		if (i == 2)
//		{
//			a = 0; 
//			b = 1; 
//			c = 1; 
//			d = 1;
//		}
//		if (i == 3)
//		{
//			a = 0; 
//			b = 0; 
//			c = 1; 
//			d = 0;
//		}
//		if (i == 4)
//		{
//			a = 0; 
//			b = 0; 
//			c = 1; 
//			d = 1;
//		}
//		if (a + b + c + d == 1)
//			printf("%d %d %d %d", a, b, c, d);
//	}
//
//	return 0;
//}

//int main()
//{
//	int i = 0;
//	int j = 0;
//	int n = 0;
//	int arr[50][50] = { 0 };
//	scanf("%d", &n);
//	for ( i = 0; i <=n; i++)
//	{
//		for (j = 0; j <=i; j++)
//		{
//			arr[i][0] = 1;
//			if (i>=1 && j>=1)
//			{
//				arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
//			}
//		}
//	}
//	for (i = 0; i <=n; i++)
//	{
//		for (j = 0; j <=i; j++)
//		{
//			printf("%3d", arr[i][j]);
//		}
//		printf("\n");
//	}
//	
//	return 0;
//}


int main()
{
	while (1)
	{
		printf("But");
	}
	return 0;
}